# Exercises: Group and aggregate

In [45]:
import pandas as pd
import seaborn as sns
titanic = sns.load_dataset("titanic")

In [4]:
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

### Use group by and aggregation on the "titanic" dataset to answer the following questions:

Q1: How many males and how many females were onboard titanic?

In [3]:
gender_count = titanic.groupby("sex")["sex"].count()
print(gender_count)

sex
female    314
male      577
Name: sex, dtype: int64

### Q2: How many males and how many females survived?

In [3]:
survived = titanic.groupby(["sex", "survived"])["survived"].count()
survived

sex     survived
female  0            81
        1           233
male    0           468
        1           109
Name: survived, dtype: int64

### Q3: How many people traveled in each class, and what was the total amount spent on tickets in each class?

In [8]:
classes = titanic.groupby("class")

C:\Users\user\AppData\Local\Temp\ipykernel_14940\2866773980.py:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  classes = titanic.groupby("class")

In [9]:
classes.count()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,who,adult_male,deck,embark_town,alive,alone
class,,,,,,,,,,,,,,
First,216,216,216,186,216,216,216,214,216,216,175,214,216,216
Second,184,184,184,173,184,184,184,184,184,184,16,184,184,184
Third,491,491,491,355,491,491,491,491,491,491,12,491,491,491

In [24]:
first_class = classes.get_group("First")
second_class = classes.get_group("Second")
third_class = classes.get_group("Third")

In [27]:
fare_first_class = first_class.agg("fare").sum()
fare_second_class = second_class.agg("fare").sum()
fare_third_class = third_class.agg("fare").sum()

print(f"first class total amount = {fare_first_class}£")
print(f"second class total amount = {fare_second_class}£")
print(f"third class total amount = {fare_third_class}£")

first class total amount = 18177.4125£
second class total amount = 3801.8417£
third class total amount = 6714.6951£

### Q4: Where did most people embark, and what town had the highest ratio of survivors?

In [28]:
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [40]:
embarked_count = titanic['embarked'].value_counts()

most_embarked_town = embarked_count.idxmax()
print(f"Most common town to embark is: {most_embarked_town}")

Most common town to embark is: S

In [50]:
survival_stats = titanic.groupby(["survived", "embarked"])["survived"].count()
survival_stats

survived  embarked
0         C            75
          Q            47
          S           427
1         C            93
          Q            30
          S           217
Name: survived, dtype: int64

In [53]:
embarked_ratios = survival_stats.unstack(level=1).fillna(0)
embarked_ratios['Survivor_Ratio'] = embarked_ratios[1] / (embarked_ratios[0] + embarked_ratios[1])

location_with_highest_ratio = embarked_ratios['Survivor_Ratio'].idxmax()

print("The location with the highest survivor ratio is:", location_with_highest_ratio)

KeyError: 1